src/InformationRegisters/ЗначенияПараметровОбследований.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияПараметровОбследований</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Comment>Порядок вывода реквизита в документе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШаблонОбследования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныОбследований</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыОбследований</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Зуб</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Зубы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОбращения</v8:Type>
						<v8:Type>cfg:CatalogRef.Диагнозы</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.ЗначенияПараметровОбследований</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/ШаблоныОбследований.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ШаблоныОбследований</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>HTMLШаблон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Специализация</Name>
					<Comment>Специализация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоответствияПараметрам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыОбследований</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядковыйНомер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/ЗначенияПараметровОбследований/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

// Функция вернет временную таблицу с выборкой данных шаблону обследования
// "Обследование стоматолога" для всех документов
Функция ПолучитьМенеджераВременнойТаблицыОбследованияСтоматолога(Контрагент, ПреимСсылка = Неопределено, МассивПриемов = Неопределено, ДиагнозСКодом = Ложь) Экспорт
	
	ЗапросВЫборка = Новый Запрос();
    ЗапросВЫборка.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗначенияПараметровОбследований.Документ КАК Прием,
	|	ЗначенияПараметровОбследований.Параметр КАК Реквизит,
	|	ЗначенияПараметровОбследований.Зуб КАК Зуб,
	|	ЗначенияПараметровОбследований.ЗначениеСтрокой КАК Значение,
	|	ЗначенияПараметровОбследований.Значение КАК ЗначениеПоля,
	|	ЗначенияПараметровОбследований.Параметр.Наименование КАК РеквизитНаименование,
	|	ЗначенияПараметровОбследований.Параметр.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
	|	ЗначенияПараметровОбследований.Параметр.ПривязкаКЗубам КАК ПривязкаКЗубам,
	|	ЗначенияПараметровОбследований.ШаблонОбследования КАК ШаблонОбследования,
	|	ЗначенияПараметровОбследований.Значение.Код КАК КодМКБ10
	|ИЗ
	|	РегистрСведений.ЗначенияПараметровОбследований КАК ЗначенияПараметровОбследований
	|ГДЕ
	|	ЗначенияПараметровОбследований.Документ.Контрагент = &Контрагент
	|	И ВЫБОР
	|			КОГДА &Документ <> НЕОПРЕДЕЛЕНО
	|				ТОГДА ЗначенияПараметровОбследований.Документ = &Документ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ОтборПоПриемам = ИСТИНА
	|				ТОГДА ЗначенияПараметровОбследований.Документ В (&МассивПриемов)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗначенияПараметровОбследований.Документ,
	|	ЗначенияПараметровОбследований.ПорядковыйНомер";
	
	ЗапросВЫборка.УстановитьПараметр("Контрагент"    , Контрагент);
	ЗапросВЫборка.УстановитьПараметр("Документ"      , ПреимСсылка);
	ЗапросВЫборка.УстановитьПараметр("МассивПриемов" , МассивПриемов);
    ЗапросВЫборка.УстановитьПараметр("ОтборПоПриемам", МассивПриемов <> Неопределено);
	
	РезультатЗапроса = ЗапросВЫборка.Выполнить().Выгрузить();
		
	ВременнаяТаблица = Новый ТаблицаЗначений;
	ВременнаяТаблица.Колонки.Добавить("Прием"                		, Новый ОписаниеТипов("ДокументСсылка.Прием"));
	ВременнаяТаблица.Колонки.Добавить("РеквизитИмя"          		, Новый ОписаниеТипов("Строка"));
	ВременнаяТаблица.Колонки.Добавить("РеквизитНаименование" 		, Новый ОписаниеТипов("Строка"));
	ВременнаяТаблица.Колонки.Добавить("РеквизитЗначение"     		, Новый ОписаниеТипов("Строка"));
	ВременнаяТаблица.Колонки.Добавить("ЭтоТитульныйРеквизит" 		, Новый ОписаниеТипов("Булево"));
	ВременнаяТаблица.Колонки.Добавить("ТипРеквизита");
    ВременнаяТаблица.Колонки.Добавить("КодМКБ10"             		, Новый ОписаниеТипов("Строка"));

	//// Построение временной таблицы
	ТекщийДокумент = Неопределено;
	ТекущаяСтрока  = Неопределено;
	Для Каждого СтрокаТ ИЗ РезультатЗапроса Цикл
		
		СтрокаТВ = Неопределено;
		Если СтрокаТ.ПривязкаКЗубам Тогда
			НайденныеСтроки = ВременнаяТаблица.НайтиСтроки(Новый Структура("Прием,РеквизитНаименование",СтрокаТ.Прием,СтрокаТ.РеквизитНаименование)); 
			Если НайденныеСтроки.Количество() > 0 Тогда
				СтрокаТВ = НайденныеСтроки[0];
			КонецЕсли;
		КонецЕсли;

		Если СтрокаТВ = Неопределено Тогда 
			
			Если МассивПриемов <> Неопределено Тогда
				НайденныеСтроки = ВременнаяТаблица.НайтиСтроки(Новый Структура("РеквизитНаименование", СтрокаТ.РеквизитНаименование));
				Если НайденныеСтроки.Количество() > 0 Тогда
					СтрокаТВ = НайденныеСтроки[0];
				КонецЕсли;
			КонецЕсли;
						
	    КонецЕсли;
		
		Если СтрокаТВ = Неопределено Тогда 
		    СтрокаТВ = ВременнаяТаблица.Добавить();
        КонецЕсли;

		СтрокаТВ.Прием                = СтрокаТ.Прием;
		СтрокаТВ.РеквизитНаименование = СтрокаТ.РеквизитНаименование;
		Если НЕ ЗначениеЗаполнено(СтрокаТ.ИмяПредопределенныхДанных) Тогда
			СтрокаТВ.РеквизитИмя          = СтрЗаменить(СтрЗаменить(ТРег(СтрокаТ.РеквизитНаименование)," ",""),",","");
		Иначе
			СтрокаТВ.РеквизитИмя          = СтрокаТ.ИмяПредопределенныхДанных;
		КонецЕсли;
 
		СтрокаТВ.РеквизитЗначение     = СтрокаТВ.РеквизитЗначение 
		                              + ?(ЗначениеЗаполнено(СтрокаТВ.РеквизитЗначение),"; ","")
									  + ?(ЗначениеЗаполнено(СтрокаТ.Зуб),"" + СтрокаТ.Зуб + " - ","") + СтрокаТ.Значение;
									  							  
		Если ЗначениеЗаполнено(СтрокаТ.ЗначениеПоля) И ТипЗнч(СтрокаТ.ЗначениеПоля) = Тип("СправочникСсылка.Диагнозы") И ЗначениеЗаполнено(СтрокаТ.КодМКБ10) Тогда			  
			ЧистыйКодМКБ10 = СокрЛП(СтрокаТ.КодМКБ10);
			СтрокаТВ.КодМКБ10 = СтрокаТВ.КодМКБ10 + ?(ЗначениеЗаполнено(ЧистыйКодМКБ10), ЧистыйКодМКБ10 + "; ", "");			
			СтрокаТВ.РеквизитЗначение = ?(ДиагнозСКодом = Истина, СокрЛП(СтрокаТВ.РеквизитЗначение) + ", " + ЧистыйКодМКБ10, СтрокаТВ.РеквизитЗначение);
			
		Иначе
			СтрокаТВ.КодМКБ10 = "";
		КонецЕсли;	
		 		 
		СтрокаТВ.ТипРеквизита = ТипЗнч(СтрокаТ.ЗначениеПоля);
																	  																	  
		 // Для первичного осмотра необходимо определить титульные реквизиты							  
		Если СтрокаТ.ШаблонОбследования = Справочники.ШаблоныОбследований.ПервичныйСтоматологическийОсмотр Тогда	 
			 Если СтрокаТ.Реквизит = ПланыВидовХарактеристик.ПараметрыОбследований.Диагноз
				 ИЛИ СтрокаТ.Реквизит = ПланыВидовХарактеристик.ПараметрыОбследований.Жалобы 
				 ИЛИ СтрокаТ.Реквизит = ПланыВидовХарактеристик.ПараметрыОбследований.ПеренесенныеИСопутствующиеЗаболевания
				 ИЛИ СтрокаТ.Реквизит = ПланыВидовХарактеристик.ПараметрыОбследований.РазвитиеНастоящегоЗаболевания
				 ИЛИ СтрокаТ.Реквизит = ПланыВидовХарактеристик.ПараметрыОбследований.ДанныеОбъективногоИсследования
				 ИЛИ СтрокаТ.Реквизит = ПланыВидовХарактеристик.ПараметрыОбследований.Прикус
				 ИЛИ СтрокаТ.Реквизит = ПланыВидовХарактеристик.ПараметрыОбследований.СостояниеСлизистойОболочкиПолостиРта
				 ИЛИ СтрокаТ.Реквизит = ПланыВидовХарактеристик.ПараметрыОбследований.ДанныеРентгеновскихЛабораторныхИсследований Тогда
				 
				 СтрокаТВ.ЭтоТитульныйРеквизит = Истина;
			 КонецЕсли;	 			  
		КонецЕсли;	
	КонецЦикла;
	   
   Возврат ВременнаяТаблица;
	
КонецФункции

#КонецОбласти
